IDENTIFICATION DIVISION.
PROGRAM-ID. NOFETCH.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT PROC-VERSION-FILE ASSIGN TO "/proc/version"
        ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD  PROC-VERSION-FILE.
    01  VERSION-LINE PIC X(255).

WORKING-STORAGE SECTION.
    01  RANDOM-MESSAGE PIC X(44).
    01  MESSAGES.
        02  FILLER PIC X(44) VALUE "probably a computer".
        02  FILLER PIC X(44) VALUE "there's probably some ram in there".
        02  FILLER PIC X(44) VALUE "init should ideally be running".
        02  FILLER PIC X(44) VALUE "yeah".
        02  FILLER PIC X(44) VALUE "you should probably go outside".
        02  FILLER PIC X(44) VALUE "i would be lead to believe that / is mounted".
        02  FILLER PIC X(44) VALUE "hey, what's this knob do?".
        02  FILLER PIC X(44) VALUE "i use arch btw".
    01  MESSAGE-TABLE REDEFINES MESSAGES.
        02  MESSAGE-ITEM PIC X(44) OCCURS 8 TIMES.
    01  RANDOM-NUMBER PIC 9(2).
    01  VERSION-INFO PIC X(50).
    01  POS PIC 9(4) COMP.

PROCEDURE DIVISION.
MAIN-PARAGRAPH.
    PERFORM GENERATE-RANDOM-NUMBER.
    PERFORM GET-RANDOM-MESSAGE.
    PERFORM GET-VERSION-INFO.
    DISPLAY " ".
    DISPLAY "> " RANDOM-MESSAGE.
    DISPLAY "> " VERSION-INFO.
    DISPLAY " ".
    STOP RUN.

GENERATE-RANDOM-NUMBER.
    COMPUTE RANDOM-NUMBER = FUNCTION RANDOM * 8 + 1.

GET-RANDOM-MESSAGE.
    COMPUTE RANDOM-NUMBER = RANDOM-NUMBER.
    MOVE MESSAGE-ITEM(RANDOM-NUMBER) TO RANDOM-MESSAGE.

GET-VERSION-INFO.
    OPEN INPUT PROC-VERSION-FILE.
    READ PROC-VERSION-FILE INTO VERSION-LINE.
    CLOSE PROC-VERSION-FILE.

    MOVE VERSION-LINE TO VERSION-INFO.

    INSPECT VERSION-INFO TALLYING POS FOR CHARACTERS BEFORE INITIAL "("
    IF POS > 0 THEN
        MOVE VERSION-INFO(1:POS - 1) TO VERSION-INFO
    END-IF.


